great
excellent
wonderful
best
of_best
one_of_best
love
perfect
loved
amazing
beautiful
well
superb
brilliant
favorite
life
highly
must_see
also
very
fantastic
beautifully
one_of
both
very_well
always
enjoyed
performances
today
well_worth
highly_recommend
years
8_10
10_10
touching
this_great
outstanding
world
wonderfully
strong
highly_recommended
perfectly
7_10
8
powerful
definitely
unique
terrific
own
especially
classic
gem
love_this
story_of
still
heart
7
true
different
masterpiece
recommended
gives
job
subtle
great_movie
9_10
very_good
loved_this
underrated
delightful
brilliantly
greatest
great_film
performance_as
on_dvd
great_job
each
incredible
stunning
hilarious
well_done
will
enjoyable
captures
fun
works
finest
war
shows
memorable
oscar
moving
family
solid
highly_recommend_this
friendship
lives
first_saw
definitely_worth
beauty
may_not
magnificent
refreshing
many
sweet
journey
well_written
simple
rare
remarkable
enjoy
fascinating
complex
realistic
emotions
top_notch
recommend
first_time
tale
awesome
music
extraordinary
human
perfection
enjoyed_this
unforgettable
this_excellent
7_out_of
7_out
played
charming
fine
7_out_of_10
favourite
portrayal
one_of_most
of_most
dvd
at_same
see_for
brings
so_well
what_makes
superbly
experience
series
favorites
gorgeous
romantic
movie_great
flawless
intense
first_saw_this
it's_great
8_out
helps
10_out
8_out_of
good_as
most
although
funniest
10_out_of_10
very_funny
relationship
for_first_time
makes
unexpected
very_different
unlike
excellent_film
timeless
marvelous
atmosphere
9
pleasantly_surprised
edge
later
effective
at_time
may
don't_miss
feelings
liked
exceptional
see_again
who
new
does_great
delight
very_entertaining
first_rate
of_seat
wonderful_film
haunting
to_see_again
quite
city
may_not_be
gripping
for_everyone
noir
understated
recommend_this
believable
provides
perfect_as
really_enjoyed
meets
nicely
of_war
freedom
adds
impressed
fabulous
tells
ways
society
often
appreciated
episodes
just_right
tears
9_out_of_10
available
tragic
others
great_acting
treat
gritty
crafted
as_good
compelling
score
best_film
acting_great
of_fun
very_enjoyable
become
world_of
of_funniest
can't_wait
nevertheless
just_great
this_best
performances_by
unusual
entertaining
this_one_of
of_human
be_missed
surprisingly
thanks
ages
beautiful_film
easy
happiness
genius
warm
favorite_movies
sadness
saw_this
recently
at_first
delivers
brought
nature
fresh
surprised
truly
those_who
day
not_perfect
vhs
appreciate
for_those
deeply
touches
riveting
adds_to
released
keeps
sensitive
well_acted
innocence
not_be
sense_of
splendid
best_movie
to_all
heartbreaking
growing_up
late
spectacular
sometimes
that_will
satisfying
as_good_as
jean
chilling
overlooked
very_much
shows_how
quiet
times
excellently
together
masterful
really_enjoyed_this
see
hooked
this_very
happy
season
joy_to
would_love_to
thoroughly_enjoyed
small
lot_of_fun
feel_good
very_moving
bit
can_relate
surprising
thought_provoking
viewings
easy_to
steals
courage
tremendous
chance
reality
steals_show
moved
traditional
fast_paced
on_edge_of
recommend_to
definitely_recommend
power_of
surreal
takes
at_times
images
so_real
raw
to_be_missed
must_for
touched
deals_with
in_lives
this_very_good
very_real
strength
film_very
pleasant
light
soundtrack
sharp
pleasure
to_anyone_who
paced
frank
performances_of
impact
this_gem
impressive
future
dreams
eerie
touch
matthau
it's_very
top
miss_this
portrait_of
yet
story_told
also_good
only_complaint
wrenching
even_better
follows
everyday
sees
witty
engrossing
simplicity
very_believable
carries
cried
brutal
explores
twists_turns
best_of_all
unfolds
innocent
inspiring
really_good
consequences
episode
work_of
back_in
tender
would_recommend
but_still
delightfully
older
comedies
blend_of
mesmerizing
really_liked
watch_again
remembered
james_stewart
everyone_should
thumbs_up
cleverly
won't_be_disappointed
fears
won't_regret
worth_seeing
black_white
mature
stands
ideal
time_when
french
guilt
spot_on
as_ever
enjoyable_film
release
little_film
holds_up
bad
worst
waste
awful
terrible
worse
boring
no
stupid
waste_of
nothing
horrible
of_worst
poor
minutes
so_bad
even
just
crap
supposed
one_of_worst
poorly
acting
at_all
plot
why
ridiculous
script
lame
worst_movie
avoid
not_even
wasted
annoying
dull
money
oh
mess
pointless
laughable
any
cheap
pathetic
bad_acting
least
badly
unless
instead
could
redeeming
1
fails
2
garbage
couldn't
really_bad
sorry
bad_movie
how_bad
than_this
save
only
avoid_this
anything
minutes_of
reason
didn't
looks_like
to_make
predictable
this_piece_of
bother
off
unfortunately
decent
not_worth
sit_through
to_be
guess
3
this_piece
no_sense
not_funny
excuse
dumb
4_10
ok
4
attempt
of_crap
whatsoever
looks
better
3_10
unfunny
nothing_to
low
wooden
idea
mean
look_like
to_sit_through
would
absolutely_no
wasn't
amateurish
sucks
don't_even
joke
none_of
bunch_of
lousy
half
this_crap
either
watching_this
1_10
disappointing
disappointment
only_good
trash
dreadful
painful
atrocious
bad_but
rubbish
mediocre
someone
attempt_at
very_bad
apparently
could_been
hour
bored
just_plain
wrong
can't
insult
weak
remotely
not_good
watching
problem
this_thing
this_mess
only_reason
or_something
bland
save_this
1_out
should
looked
completely
embarrassing
tedious
it's_just
uninteresting
crappy
wasting
be_funny
2_10
costs
just_bad
unbelievable
as_if
bad_this
doesn't_even
okay
stinker
trying
no_plot
time_money
flat
movie_just
this_just
only_thing
unconvincing
failed
insult_to
silly
pile
but_this
dialogue
if_want
any_of
skip_this
maybe
why_did
much_better
forgettable
only_good_thing
incoherent
uninspired
pretty_bad
unwatchable
0
way_too
4_out_of_10
absolutely_nothing
through_this
non_existent
horribly
miserably
cliché
rip_off
with_this
idiotic
except
random
stay_away
nowhere
if_want_to
wouldn't
3_out_of_10
write
barely
lack_of
isn't_even
seconds
junk
i'm_sorry
rent
fast_forward
looked_like
drivel
seemed
mildly
asleep
2_out_of_10
irritating
would_been
this_turkey
embarrassed
hours_of_life
premise
boredom
hoping
mst3k
make_movie
complete
supposedly
honestly
can't_believe
gore
rented
attempt_to
no_real
paid
some_kind_of
this_supposed
inept
just_didn't
if_this
horrid
only_redeeming
90_minutes
god
nonsense
obvious
that's_about
lacks
appalling
just_not
stupidity
clichéd
not_recommend
effort
turkey
ashamed
camera
come_on
basically
2_out
doesn't_work
let's
even_that
pretentious
sucked
sat_through
whole_movie
b_movie
save_money
this_movie_so_bad
shallow
not_that
10_minutes
clichés
minutes_into
looking
about_as
ludicrous
care
any_of_characters
tripe
insulting
thing_about
not_enough
grade
cardboard
couldn't_even
care_about
suppose
disaster
money_back
skip
little_to
worthless
neither
did
rest
walked_out
writing
nudity
unintentionally
useless
unintentional
screaming
might
thin
writers
do_not
tries_to_be
wanted_to_like
ugly
rip_off_of
wonder
going_for
very_disappointed
downhill
most_boring
disappointed
potential
endless
but_fails
on_on
do_not_watch_this
more_like
mystery_science
sub_par
just_doesn't
should_been
just_isn't
unnecessary
be_good
no_story
watchable
pitiful
for_this
so_called
even_get
that_would
to_write
producers
grade_d
what_thinking
trite
if_had
moronic
far_too
attempts_at
below
below_average
miscast
rented_this
t
absurd
if_want_to_see
continuity
dreck
like_bad
embarrassment
for_free
what_point
zombies
original
should_never
don't_watch_this
rest_of_movie
dimensional
cover
yawn
actors
obnoxious
kidding
unrealistic
only_saving
sex
you'd
ripped
ruined
walked
alright
be_comedy
seemed_to
confusing
too_many
bore
like_watching
felt_like
disgusting
sadly
how_not_to
ever
very_little
promising
doesn't_make
fell_asleep
muddled
didn't_care
otherwise
at_best
not_very
nothing_in
trying_to_be
turd
no_chemistry
paper
paint
one_dimensional
terribly
two_hours
stinks
doesn't_help
why_do
embarrassingly
seems
disjointed
unlikeable
sort
would_not_recommend
dire
stock_footage
sake
without_any
had_high
incomprehensible
project
stick_to
what_point_of
just_too
this_junk
would_been_better
advice
in_movie
filmmakers
seagal
not_make
to_believe
abomination
walking_around
just_wasn't
yourself_favor
did_this
entire
but_even
insipid
interesting_but
one_star
potential_but
offensive
not_much
awfulness
hated
going_to
cash_in
could_been_good
thrown
not_very_good
from_outer_space
bottom_of_barrel
of_barrel
lifeless
on_plus_side
but_why
f
not_recommended
repetitive
about_any_of
ed_wood
film_school
hackneyed
could_been_so
not_one
unintentionally_funny
lazy
bin
of_this_movie
inappropriate
bothered_to
very_disappointing
drags
even_close
accent
only_positive
wasn't_funny
hard_to_be
made_this
generic
spent_on
didn't_work
positive
blah
lacked
fails_on
give_break
shelf
film_just
olds
if_director
problem_that
out
no_wonder
failure
outer_space
something_better
lacking
biggest_problem
lackluster
give_1
called
believe_that
to_work_with
tasteless
to_recommend
call_that
i'm_afraid
some_good
1_2_from
around_in
saving
interesting_or
tiresome
main_problem
movie_only
tired
scientist
to_care
annoyed
oh_wait
forwarding
give_3
who_made_this
this_travesty
to_believe_that
flimsy
stunk
what's_with
this_dull
